# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 0.5  # layer channel multiple

# anchors
anchors:
  - [6,6, 8,16, 18,13]  # P5/32
  - [15,32, 36,30, 33,71]  # P5/32
  - [77,57, 85,131, 207,168]  # P5/32
# custom backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, BMConv, [3]],    # 0-P2/4
   [-1, 1, ShuffleNetV2, [48, 2]], # 1-P3/8
   [-1, 3, ShuffleNetV2, [48, 1]], # 2
   [-1, 1, ShuffleNetV2, [96, 2]], # 3-P4/16
   [-1, 7, ShuffleNetV2, [96, 1]], # 4
   [-1, 1, ShuffleNetV2, [192, 2]], # 5-P5/32
   [-1, 3, ShuffleNetV2, [192, 1]], # 6
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, C3, [128, False]],  # 10

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, C3, [128, False]],  # 14 (P3/8-small)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat head P4
   [-1, 1, C3, [128, False]],  # 17 (P4/16-medium)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 7], 1, Concat, [1]],  # cat head P5
   [-1, 1, C3, [128, False]],  # 20 (P5/32-large)

   [[14, 17, 20], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]

