# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# custom backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, conv_bn_relu_maxpool, [3]],    # 0-P2/4
   [-1, 1, ShuffleNetV2_InvertedResidual, [48, 2]], # 1-P3/8
   [-1, 3, ShuffleNetV2_InvertedResidual, [48, 1]], # 2
   [-1, 1, ShuffleNetV2_InvertedResidual, [96, 2]], # 3-P4/16
   [-1, 7, ShuffleNetV2_InvertedResidual, [96, 1]], # 4
   [-1, 1, ShuffleNetV2_InvertedResidual, [192, 2]], # 5-P5/32
   [-1, 3, ShuffleNetV2_InvertedResidual, [192, 1]], # 6
  ]

# YOLOv5 v6.0 FPN head
head:
  [[-1, 3, BottleneckCSP, [192, False]],  # 7 (P5/32-large)

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, Conv, [96, 1, 1]],
   [-1, 3, BottleneckCSP, [96, False]],  #11  (P4/16-medium)

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, Conv, [48, 1, 1]],
   [-1, 3, BottleneckCSP, [48, False]],  # 15 (P3/8-small)

   [[15, 11, 7], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
