# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.12  # layer channel multiple
anchors:
  - [9,12, 21,18, 17,41] #P3/8
  - [40,32, 38,73, 86,57] #P4/16
  - [69,120, 144,123, 109,240] #P5/32
  - [331,182, 216,326, 467,375 ] #P6/64

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 7, 2, 3]],  # 0-P1/2
   [-1, 1, Conv, [64, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [64, False]],
    #[[-1,2],1,Concat,[1]],
   [-1, 1, Conv, [128, 3, 2]],  # 4-P3/8
   [-1, 3, C3, [128, False]],
    #[[-1,4],1,Concat,[1]],
   [-1, 1, Conv, [256, 3, 2]],  # 7-P4/16
   [-1, 3, C3, [256, False]],
    #[[-1,7],1,Concat,[1]],
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16
   [-1, 3, C3, [512, False]],
  ]

# YOLOv5 v6.0 head
head:
  [
  [-1, 1, Classify, [nc]]  # Detect(P3, P4, P5, P6)
  ]
